micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_eth.c
  /* MAC default configuration */
  ETH_SetMACConfig(heth, &macDefaultConf);

  /*--------------- ETHERNET MTL registers default Configuration --------------*/
  /* Common configuration for Q0 and Q1*/
  mtlDefaultConf.RxQ[0].MappedToDMACh = ETH_MTL_Q0_MAPPED_TO_DMA_CH0;
#if ETH_MTL_RX_Q_CNT == 2
  mtlDefaultConf.RxQ[1].MappedToDMACh = ETH_MTL_Q1_MAPPED_TO_DMA_CH1;
#endif /* ETH_MTL_TX_Q_CNT == 2 */
  mtlDefaultConf.ReceiveArbitrationAlgorithm = ETH_MTLOMR_RAA_SP;
  mtlDefaultConf.TxSchedulingAlgorithm = ETH_MTLOMR_SCHALG_SP;
  mtlDefaultConf.TransmitStatus = ENABLE;

  /* RxQ & TxQ configuration */
  mtlDefaultConf.RxQ[0].QueueOpMode = ETH_RX_QUEUE0_ENABLED;
  mtlDefaultConf.RxQ[1].QueueOpMode = ETH_RX_QUEUE1_ENABLED;
  mtlDefaultConf.TxQ[1].AVAlgorithm = ETH_TX_QUEUE_AV_ALGO_SP;

  for (queue = 0; queue < ETH_MTL_RX_Q_CNT; queue++)
  {
    /* RxQ configuration */
    mtlDefaultConf.RxQ[queue].DropTCPIPChecksumErrorPacket = ENABLE;
    mtlDefaultConf.RxQ[queue].ForwardRxErrorPacket = DISABLE;
    mtlDefaultConf.RxQ[queue].ForwardRxUndersizedGoodPacket = DISABLE;
    mtlDefaultConf.RxQ[queue].ReceiveQueueMode = ETH_RECEIVESTOREFORWARD;
    mtlDefaultConf.RxQ[queue].RxQueueSize = ETH_RECEIVE_QUEUE_SIZE_4096;

    /* TxQ configuration */
    mtlDefaultConf.TxQ[queue].TransmitQueueMode = ETH_TRANSMITSTOREFORWARD;
    mtlDefaultConf.TxQ[queue].QueueOpMode = ETH_TX_QUEUE_ENABLED;
    mtlDefaultConf.TxQ[queue].TxQueueSize = ETH_TRANSMIT_QUEUE_SIZE_2048;
  }

  /* MTL default configuration */
  ETHEx_SetMTLConfig(heth, &mtlDefaultConf);

  /*--------------- ETHERNET DMA registers default Configuration --------------*/
  /* Common DMA configuration */
  dmaDefaultConf.AddressAlignedBeats = ENABLE;
  dmaDefaultConf.AXIBLENMaxSize = ETH_BLEN_MAX_SIZE_4;
  dmaDefaultConf.BurstMode = ETH_BURSTLENGTH_FIXED;
  dmaDefaultConf.RxOSRLimit = ETH_RX_OSR_LIMIT_3;
  dmaDefaultConf.TxOSRLimit = ETH_TX_OSR_LIMIT_3;
  dmaDefaultConf.TransmitArbitrationAlgorithm = ETH_DMATXARBITRATION_FIXED_PRIO;
  dmaDefaultConf.TransmitPriority = DISABLE;

  for (ch = 0; ch < ETH_DMA_CH_CNT; ch++)
  {
    /* DMA CH configuration */
    dmaDefaultConf.DMACh[ch].FlushRxPacket = DISABLE;
    dmaDefaultConf.DMACh[ch].PBLx8Mode = DISABLE;
    dmaDefaultConf.DMACh[ch].RxDMABurstLength = ETH_RXDMABURSTLENGTH_32BEAT;
    dmaDefaultConf.DMACh[ch].SecondPacketOperate = DISABLE;
    dmaDefaultConf.DMACh[ch].TCPSegmentation = DISABLE;
    dmaDefaultConf.DMACh[ch].TxDMABurstLength = ETH_TXDMABURSTLENGTH_32BEAT;
    dmaDefaultConf.DMACh[ch].DescriptorSkipLength = ETH_DMA_DESC_SKIP_LENGTH_32;
    dmaDefaultConf.DMACh[ch].MaximumSegmentSize = ETH_SEGMENT_SIZE_DEFAULT;
  }
  /* DMA default configuration */
  ETH_SetDMAConfig(heth, &dmaDefaultConf);
}


/**
  * @brief  Initializes the DMA Tx descriptors.
  *         called by HAL_ETH_Init() API.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval None
  */
static void ETH_DMATxDescListInit(ETH_HandleTypeDef *heth)
{
  ETH_DMADescTypeDef *dmatxdesc;
  uint32_t i;
  uint32_t ch;

  /* Fill each DMATxDesc descriptor with the right values */
  for (ch = 0; ch < (uint32_t)ETH_DMA_TX_CH_CNT; ch++)
  {
    for (i = 0; i < (uint32_t)ETH_TX_DESC_CNT; i++)
    {
      dmatxdesc = heth->Init.TxDesc[ch] + i;

      WRITE_REG(dmatxdesc->DESC0, 0x0U);
      WRITE_REG(dmatxdesc->DESC1, 0x0U);
      WRITE_REG(dmatxdesc->DESC2, 0x0U);
      WRITE_REG(dmatxdesc->DESC3, 0x0U);

      WRITE_REG(heth->TxDescList[ch].TxDesc[i], (uint32_t)dmatxdesc);
    }

    heth->TxDescList[ch].CurTxDesc = 0;
  }

  for (ch = 0; ch < ETH_DMA_CH_CNT; ch++)
  {
    /* Set Transmit Descriptor Ring Length for DMA Channel  */
    WRITE_REG(heth->Instance->DMA_CH[ch].DMACTXRLR, (ETH_TX_DESC_CNT - 1U));

    /* Set Transmit Descriptor List Address for DMA Channel */
    WRITE_REG(heth->Instance->DMA_CH[ch].DMACTXDLAR, (uint32_t) heth->Init.TxDesc[ch]);

    /* Set Transmit Descriptor Tail pointer for DMA Channel  */
    WRITE_REG(heth->Instance->DMA_CH[ch].DMACTXDTPR, (uint32_t) heth->Init.TxDesc[ch]);
  }
}

/**
  * @brief  Initializes the DMA Rx descriptors in chain mode.
  *         called by HAL_ETH_Init() API.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval None
  */
static void ETH_DMARxDescListInit(ETH_HandleTypeDef *heth)
{
  ETH_DMADescTypeDef *dmarxdesc;
  uint32_t i;
  uint32_t ch;

  for (ch = 0; ch < (uint32_t)ETH_DMA_RX_CH_CNT; ch++)
  {
    /* Fill each DMACxRxDesc descriptor with the right values */
    for (i = 0; i < (uint32_t)ETH_RX_DESC_CNT; i++)
    {
      dmarxdesc =  heth->Init.RxDesc[ch] + i;

      WRITE_REG(dmarxdesc->DESC0, 0x0U);
      WRITE_REG(dmarxdesc->DESC1, 0x0U);
      WRITE_REG(dmarxdesc->DESC2, 0x0U);
      WRITE_REG(dmarxdesc->DESC3, 0x0U);
      WRITE_REG(dmarxdesc->BackupAddr0, 0x0U);
      WRITE_REG(dmarxdesc->BackupAddr1, 0x0U);

      /* Set Rx descritors addresses */
      WRITE_REG(heth->RxDescList[ch].RxDesc[i], (uint32_t)dmarxdesc);
    }

    /* Initialize DMA Ch Rx parameters */
    WRITE_REG(heth->RxDescList[ch].RxDescIdx, 0U);
    WRITE_REG(heth->RxDescList[ch].RxDescCnt, 0U);
    WRITE_REG(heth->RxDescList[ch].RxBuildDescIdx, 0U);
    WRITE_REG(heth->RxDescList[ch].RxBuildDescCnt, 0U);
    WRITE_REG(heth->RxDescList[ch].ItMode, 0U);

    /* Set Receive Descriptor Ring Length for DMA Channel */
    WRITE_REG(heth->Instance->DMA_CH[ch].DMACRXRLR, ((uint32_t)(ETH_RX_DESC_CNT - 1U)));

    /* Set Receive Descriptor List Address for DMA Channel */
    WRITE_REG(heth->Instance->DMA_CH[ch].DMACRXDLAR, (uint32_t) heth->Init.RxDesc[ch]);

    /* Set Receive Descriptor Tail pointer Address for DMA Channel */
    WRITE_REG(heth->Instance->DMA_CH[ch].DMACRXDTPR,
              ((uint32_t)(heth->Init.RxDesc[ch] + (uint32_t)(ETH_RX_DESC_CNT - 1U))));
  }
}

/**
  * @brief  Prepare Tx DMA descriptor before transmission.
  *         called by HAL_ETH_Transmit_IT and HAL_ETH_Transmit_IT() API.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  pTxConfig: Tx packet configuration
  * @param  ItMode: Enable or disable Tx EOT interrupt
  * @retval Status
  */
static uint32_t ETH_Prepare_Tx_Descriptors(ETH_HandleTypeDef *heth, const ETH_TxPacketConfigTypeDef *pTxConfig,
                                           uint32_t ItMode)
{
  uint32_t ch = pTxConfig->TxDMACh;

  ETH_TxDescListTypeDef *dmatxdesclist = &heth->TxDescList[ch];

  uint32_t descidx = dmatxdesclist->CurTxDesc;
  uint32_t firstdescidx = dmatxdesclist->CurTxDesc;

  uint32_t idx;
  uint32_t descnbr = 0;
  ETH_DMADescTypeDef *dmatxdesc = (ETH_DMADescTypeDef *)dmatxdesclist->TxDesc[descidx];

